Tutorials/Tutorial_case_2_CAARC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Adding libraries useful for Groovy Boundary condition
libs                ("libOpenFOAM.so" "libfieldFunctionObjects.so");
libs                ("libOpenFOAM.so" "libgroovyBC.so") ;

application         pimpleFoam;
//application     pisoFoam;

//startFrom         startTime;
startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             2000;

deltaT              0.001;

writeControl        adjustableRunTime;

writeInterval       0.001;

purgeWrite          0;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       8;


functions
{
    // Function object "KratosOpenfoamAdapterFunctionObject" to couple OpenFOAM with CoSimulation (kratos)
    KratosOpenfoamAdapterFunctionObject1
    {
        type KratosOpenfoamAdapterFunctionObject;
        libs ("../KratosOpenfoamAdapterFunctionObject/libKratosOpenfoamAdapterFunctionObjectFunctionObjects.so");

        interfaces
        {
            Interface1
            {
                name                    interface_3D_structure;
                patches                 (tubesfs);
                importDataIdentifier    (disp_interface_3D_structure);
                exportDataIdentifier    (load_interface_3D_structure);
            }
        }

        parameters
        {
            rho rho [1 -3 0 0 0 0 0] 1.2;
            nu nu [0 2 -1 0 0 0 0 ] 1.508e-05;
        }

        dim 3;
        debugLevel debug;
    }

    // Function object "CourantNo" to see courant number
    Co1
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     2;
        writeControl        writeTime;
    }

    // Function object "forces" to calcuate the total force on interface
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (tubesfs);
        rho                 rhoInf;
        log                 true;
        rhoInf              1.2;
        CofR                (0 0 0);
    }

    // Function object "Residual", To see the residual plots
    //foamMonitor -l ./postProcessing/residuals/0/residuals.dat
    #includeFunc residuals

    // Function object "probes", To plot the displacements of the flap
    // Specify this point in the system/probes file
    #includeFunc probes

}


// ************************************************************************* //
