Tutorials/Tutorial_case_2_CAARC/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (cellDisplacement);
probeLocations
(
    (23 0 180.5)
    (22.5 0 180)
    (22.5 15 180.5)
    (23 -15 180)
    (-22 0 180.5)
    (-22.5 0 180)
    (-22.5 15 180.5)
    (-22 -15 180)

);

// ************************************************************************* //
